aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gatt_server.c
/*
 * Amazon FreeRTOS
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_ble_hal_gatt_server.c
 * @brief Hardware Abstraction Layer for GATT server ble stack.
 */

/* Standard Includes. */
#include <string.h>

/* FreeRTOS Includes. */
#include "FreeRTOS.h"

/* AWS BLE Lib Includes. */
#include "bt_hal_manager_adapter_ble.h"
#include "bt_hal_manager.h"
#include "bt_hal_gatt_server.h"
#include "aws_ble_hal_internals.h"

/* Nordic/Segger Includes. */
#include "ble.h"
#include "ble_srv_common.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_log.h"
#include "nrf_ble_gatt.h"

/* Nordic port Includes. */
#include "aws_ble_hal_dis.h"

#define GATT_MAX_ENTITIES    30

uint32_t ulGattServerIFhandle;
uint16_t g_cccd_handle;
static ble_gatts_char_handles_t xLastCharAddedHanlde;
bool bInterfaceCreated = false;

static uint32_t ulGATTEvtMngHandle;
BTGattServerCallbacks_t xGattServerCb;
uint16_t usGattConnHandle = 0;

BLE_CUS_DEF( m_cus );
NRF_BLE_GATT_DEF( xGattHandler );

bool bGattInitialized = false;
const uint8_t aws_ble_hal_gatt_serverCCCD_UUID[] = { 0, 0, 0x29, 0x02, 0x79, 0xE6, 0xB5, 0x83, 0xFB, 0x4E, 0xAF, 0x48, 0x68, 0x11, 0x7F, 0x8A };

/* This table is needed to overcome a restriction imposed by the softdevice API that all additions of services, characteristics and descriptors must
 * be sequential, i.e. to add a characteristic to a service you must add it immediately after you added a service. So we fill this table firstly and
 * we actually add these entities only on prvBTStartService call.
 *
 * The culprit is that we need to return the handler for an entity immediately, so in the deferred case we need to maintain our own hadlers and translate them
 * to softdevice's and back. For this purpose the lookup table is introduced with according functions */

typedef struct
{
    ble_uuid_t uuid;
    union
    {
        ble_add_char_params_t char_properties;
        ble_add_descr_params_t descr_properties;
    } properties;
    uint16_t parent_handle;
    uint16_t handle;
    BTGattAttributeType_t type;
} BTGattEntity_t;

typedef struct
{
    uint16_t handle;
    uint16_t softdevice_handle;
} BTGattMapping_t;

BTGattEntity_t xGattTable[ GATT_MAX_ENTITIES ];
BTGattMapping_t xGattToSDMapping[ GATT_MAX_ENTITIES ];

uint8_t xGattTableSize = 0;

/* TODO: Maybe implement more efficient functions for mapping  */
uint8_t xGattMappingTablesSize = 0;

/* Needed to access static gatt handler */
nrf_ble_gatt_t * prvGetGattHandle()
{
    return &xGattHandler;
}

/**
 * @brief Returns the softdevice handle for a given inner GATT handle
 * @param handle inner GATT handle
 * @return the softdevice handle
 */
uint16_t prvGattToSDHandle( uint16_t handle )
{
    for( uint16_t i = 0; i < xGattMappingTablesSize; ++i )
    {
        if( xGattToSDMapping[ i ].handle == handle )
        {
            return xGattToSDMapping[ i ].softdevice_handle;
        }
    }

    return UINT16_MAX;
}

/**
 * @brief Returns the given inner GATT handle for a softdevice handle
 * @param handle softdevice handle
 * @return inner GATT handle
 */
uint16_t prvGattFromSDHandle( uint16_t handle )
{
    for( uint16_t i = 0; i < xGattMappingTablesSize; ++i )
    {
        if( xGattToSDMapping[ i ].softdevice_handle == handle )
        {
            return xGattToSDMapping[ i ].handle;
        }
    }

    return UINT16_MAX;
}

BTGattAttributeType_t prvGattAttributeType( uint16_t handle )
{
    for( uint16_t i = 0; i < xGattTableSize; ++i )
    {
        if( xGattTable[ i ].handle == handle )
        {
            return xGattTable[ i ].type;
        }
    }
}

/**
 * @brief Translate the given AFR BLE Character properties to a Nordic SDK SoftDevice Character properties
 * @param Permisions structure @ref BTCharProperties_t
 * @param Permisions structure @ref ble_gatt_char_props_t
 */
static void prvAFRToNordicCharProp( const BTCharProperties_t * pxAFRCharProps,
                                    ble_gatt_char_props_t * pxNordicCharProps );

/**
 * @brief Translate the given AFR BLE permisions for read access to a Nordic SDK SoftDevice permitions
 * @param Permisions structure @ref BTCharPermissions_t
 * @param Permisions structure @ref security_req_t
 */
static void prvAFRToNordicReadPerms( const BTCharPermissions_t * pxAFRPermitions,
                                     security_req_t * pxNordicPermitions );

/**
 * @brief Translate the given AFR BLE permisions for write access to a Nordic SDK SoftDevice permitions
 * @param Permisions structure @ref BTCharPermissions_t
 * @param Permisions structure @ref security_req_t
 */
static void prvAFRToNordicWritePerms( const BTCharPermissions_t * pxAFRPermitions,
                                      security_req_t * pxNordicPermitions );
static ret_code_t prvStartServiceAddDescriptors( uint16_t usCurrentCharNumber,
                                                 uint16_t usCCCDhandle );
static ret_code_t prvStartServiceAddCharacteristics( uint16_t usCurrentServiceNumber );
static BTStatus_t prvBTRegisterServer( BTUuid_t * pxUuid );
static BTStatus_t prvBTUnregisterServer( uint8_t ucServerIf );
static BTStatus_t prvBTGattServerInit( const BTGattServerCallbacks_t * pxCallbacks );
static BTStatus_t prvBTConnect( uint8_t ucServerIf,
                                const BTBdaddr_t * pxBdAddr,
                                bool bIsDirect,
                                BTTransport_t xTransport );
static BTStatus_t prvBTDisconnect( uint8_t ucServerIf,
                                   const BTBdaddr_t * pxBdAddr,
                                   uint16_t usConnId );
static BTStatus_t prvBTInvokeAttributeUuid( ble_uuid_t * pxServiceUuid,
                                            BTUuid_t * pxBaseUuid,
                                            uint8_t * pucUuidType );
static BTStatus_t prvBTAddService( uint8_t ucServerIf,
                                   BTGattSrvcId_t * pxSrvcId,
                                   uint16_t usNumHandles );
static BTStatus_t prvBTAddIncludedService( uint8_t ucServerIf,
                                           uint16_t usServiceHandle,
                                           uint16_t usIncludedHandle );
static BTStatus_t prvBTAddCharacteristic( uint8_t ucServerIf,
                                          uint16_t usServiceHandle,
                                          BTUuid_t * pxUuid,
                                          BTCharProperties_t xProperties,
                                          BTCharPermissions_t xPermissions );
static BTStatus_t prvBTSetVal( BTGattResponse_t * pxValue );
static BTStatus_t prvBTAddDescriptor( uint8_t ucServerIf,
                                      uint16_t usServiceHandle,
                                      BTUuid_t * pxUuid,
                                      BTCharPermissions_t xPermissions );
static BTStatus_t prvBTStartService( uint8_t ucServerIf,
                                     uint16_t usServiceHandle,
                                     BTTransport_t xTransport );
static BTStatus_t prvBTStopService( uint8_t ucServerIf,
                                    uint16_t usServiceHandle );
static BTStatus_t prvBTDeleteService( uint8_t ucServerIf,
                                      uint16_t usServiceHandle );
static BTStatus_t prvBTSendIndication( uint8_t ucServerIf,
                                       uint16_t usAttributeHandle,
                                       uint16_t usConnId,
                                       size_t xLen,
                                       uint8_t * pucValue,
                                       bool bConfirm );
static BTStatus_t prvBTSendResponse( uint16_t usConnId,
                                     uint32_t ulTransId,
                                     BTStatus_t xStatus,
                                     BTGattResponse_t * pxResponse );

