aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gatt_server.c
static BTGattServerInterface_t xGATTserverInterface =
{
    .pxRegisterServer     = prvBTRegisterServer,
    .pxUnregisterServer   = prvBTUnregisterServer,
    .pxGattServerInit     = prvBTGattServerInit,
    .pxConnect            = prvBTConnect,
    .pxDisconnect         = prvBTDisconnect,
    .pxAddService         = prvBTAddService,
    .pxAddIncludedService = prvBTAddIncludedService,
    .pxAddCharacteristic  = prvBTAddCharacteristic,
    .pxSetVal             = prvBTSetVal,
    .pxAddDescriptor      = prvBTAddDescriptor,
    .pxStartService       = prvBTStartService,
    .pxStopService        = prvBTStopService,
    .pxDeleteService      = prvBTDeleteService,
    .pxSendIndication     = prvBTSendIndication,
    .pxSendResponse       = prvBTSendResponse
};

/*-----------------------------------------------------------*/

BTStatus_t prvBTRegisterServer( BTUuid_t * pxUuid )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    xGattServerCb.pxRegisterServerCb( eBTStatusSuccess, ulGattServerIFhandle, pxUuid );
    return xStatus;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTUnregisterServer( uint8_t ucServerIf )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    xGattServerCb.pxUnregisterServerCb( eBTStatusSuccess, ulGattServerIFhandle );
    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGattServerInit( const BTGattServerCallbacks_t * pxCallbacks )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = nrf_ble_gatt_init( &xGattHandler, NULL );

    if( xErrCode == NRF_SUCCESS )
    {
        bGattInitialized = true;
    }

    xStatus = BTNRFError( xErrCode );

    if( xStatus == eBTStatusSuccess )
    {
        if( pxCallbacks != NULL )
        {
            xGattServerCb = *pxCallbacks;
        }
        else
        {
            xStatus = eBTStatusParamInvalid;
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTConnect( uint8_t ucServerIf,
                         const BTBdaddr_t * pxBdAddr,
                         bool bIsDirect,
                         BTTransport_t xTransport )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDisconnect( uint8_t ucServerIf,
                            const BTBdaddr_t * pxBdAddr,
                            uint16_t usConnId )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTAddService( uint8_t ucServerIf,
                            BTGattSrvcId_t * pxSrvcId,
                            uint16_t usNumHandles )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;

    ble_uuid_t ble_uuid;

    /* Try to use GATT server without observers notification */
    /* ble_cus_t * p_cus = &m_cus; */

    /* Initialize service structure */
    /* p_cus->evt_handler = NULL; */
    /* p_cus->conn_handle = BLE_CONN_HANDLE_INVALID; */

    xErrCode = prvAFRUUIDtoNordic( &pxSrvcId->xId.xUuid, &ble_uuid );

    if( xErrCode == NRF_SUCCESS )
    {
        if( xGattTableSize == GATT_MAX_ENTITIES - 1 )
        {
            xErrCode = NRF_ERROR_NO_MEM;
        }
        else
        {
            xGattTable[ xGattTableSize ].type = GATT_SERVICE;
            xGattTable[ xGattTableSize ].parent_handle = 0;
            xGattTable[ xGattTableSize ].uuid = ble_uuid;
            xGattTable[ xGattTableSize ].handle = xGattTableSize == 0 ? 1 : xGattTable[ xGattTableSize - 1 ].handle + 1;
            xGattTableSize += 1;
        }
    }

    BT_NRF_PRINT_ERROR( xGattTableAdd, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        if( xGattServerCb.pxServiceAddedCb )
        {
            xGattServerCb.pxServiceAddedCb( xStatus, ulGattServerIFhandle, pxSrvcId, xGattTable[ xGattTableSize - 1 ].handle );
        }

        NRF_LOG_INFO( "Service Added to HAL table with handle %d %x \n\r ", xGattTable[ xGattTableSize - 1 ].handle );
    }

    xStatus = BTNRFError( xErrCode );

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTAddIncludedService( uint8_t ucServerIf,
                                    uint16_t usServiceHandle,
                                    uint16_t usIncludedHandle )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTAddCharacteristic( uint8_t ucServerIf,
                                   uint16_t usServiceHandle,
                                   BTUuid_t * pxUuid,
                                   BTCharProperties_t xProperties,
                                   BTCharPermissions_t xPermissions )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;
    ble_add_char_params_t add_char_params;
    ble_uuid_t ble_uuid;

    xErrCode = prvAFRUUIDtoNordic( pxUuid, &ble_uuid );

    if( xErrCode == NRF_SUCCESS )
    {
        memset( &add_char_params, 0, sizeof( ble_add_char_params_t ) );

        add_char_params.uuid = ble_uuid.uuid;
        add_char_params.uuid_type = ble_uuid.type;

        prvAFRToNordicCharProp( &xProperties, &add_char_params.char_props );

        if( xProperties & eBTPropExtendedProps )
        {
            add_char_params.char_ext_props.reliable_wr = 0; /* NOTE: There is no information in received args */
            add_char_params.char_ext_props.wr_aux = 0;      /* NOTE: There is no information in received args */
        }

        add_char_params.max_len = BLE_GATTS_VAR_ATTR_LEN_MAX; /* Was 180 */
        add_char_params.init_len = sizeof( uint8_t );
        add_char_params.is_var_len = true;
        add_char_params.is_value_user = false;        /**< Indicate if the content of the characteristic is to be stored in the application (user) or in the stack.*/
        add_char_params.p_init_value = NULL;          /**< Initial encoded value of the characteristic.*/
        add_char_params.p_user_descr = NULL;          /**< Pointer to user descriptor if needed*/
        add_char_params.p_presentation_format = NULL; /**< Pointer to characteristic format if needed*/

        add_char_params.is_defered_read = true; /* NOTE: This field is set due to client waits for a callback when char is read */
        add_char_params.is_defered_write = false;

        prvAFRToNordicReadPerms( &xPermissions, &add_char_params.read_access );
        prvAFRToNordicWritePerms( &xPermissions, &add_char_params.write_access );

        if( xGattTableSize == GATT_MAX_ENTITIES - 1 )
        {
            xErrCode = NRF_ERROR_NO_MEM;
        }
        else
        {
            xGattTable[ xGattTableSize ].type = GATT_CHAR;
            xGattTable[ xGattTableSize ].parent_handle = UINT16_MAX;

            for( int i = 0; i < xGattTableSize; ++i )
            {
                if( ( xGattTable[ i ].type == GATT_SERVICE ) && ( xGattTable[ i ].handle == usServiceHandle ) )
                {
                    xGattTable[ xGattTableSize ].parent_handle = xGattTable[ i ].handle;
                    break;
                }
            }

            if( xGattTable[ xGattTableSize ].parent_handle == UINT16_MAX )
            {
                xErrCode = NRF_ERROR_INVALID_PARAM;
            }
            else
            {
                xGattTable[ xGattTableSize ].uuid = ble_uuid;
                xGattTable[ xGattTableSize ].handle = xGattTableSize == 0 ? 1 : xGattTable[ xGattTableSize - 1 ].handle + 2;
                xGattTable[ xGattTableSize ].properties.char_properties = add_char_params;
                xGattTableSize += 1;
            }
        }
    }

    BT_NRF_PRINT_ERROR( characteristic_add, xErrCode );

