aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gatt_server.c
    if( xErrCode == NRF_SUCCESS )
    {
        NRF_LOG_INFO( "Charachtersitics Added to HAL table with handle %d %x \n\r", xGattTable[ xGattTableSize - 1 ].handle );

        if( xGattServerCb.pxCharacteristicAddedCb )
        {
            xGattServerCb.pxCharacteristicAddedCb( xStatus,
                                                   ulGattServerIFhandle,
                                                   pxUuid,
                                                   xGattTable[ xGattTableSize - 1 ].parent_handle,
                                                   xGattTable[ xGattTableSize - 1 ].handle );
        }
    }

    return BTNRFError( xErrCode );
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTSetVal( BTGattResponse_t * pxValue )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ble_gatts_value_t xValueParams;
    ret_code_t xErrCode;

    memset( &xValueParams, 0, sizeof( xValueParams ) );
    xValueParams.len = pxValue->xAttrValue.xLen;
    xValueParams.offset = pxValue->xAttrValue.usOffset;
    xValueParams.p_value = pxValue->xAttrValue.pucValue;

    xErrCode = sd_ble_gatts_value_set( usGattConnHandle, prvGattToSDHandle( pxValue->usHandle ), &xValueParams );

    if( xErrCode != NRF_SUCCESS )
    {
        NRF_LOG_ERROR( "Error %d HVX \n\r", xErrCode );
    }
    
    xStatus = BTNRFError( xErrCode );
    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTAddDescriptor( uint8_t ucServerIf,
                               uint16_t usServiceHandle,
                               BTUuid_t * pxUuid,
                               BTCharPermissions_t xPermissions )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;

    ble_add_descr_params_t xDescrParams;

    memset( &xDescrParams, 0, sizeof( ble_add_descr_params_t ) );

    ble_uuid_t ble_uuid;
    /* Try to use GATT server without observers notification */
    /* ble_cus_t * p_cus = &m_cus; */
    xDescrParams.max_len = BLE_GATTS_VAR_ATTR_LEN_MAX; /* or BLE_GATTS_FIX_ATTR_LEN_MAX or any smaller value * / */

    /* Check if we try to add a CCCD */
    if( ( pxUuid->ucType == eBTuuidType128 ) && ( memcmp( pxUuid->uu.uu128, aws_ble_hal_gatt_serverCCCD_UUID, 16 ) == 0 ) )
    {
        ble_uuid.type = BLE_UUID_TYPE_BLE;
        ble_uuid.uuid = BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG;
        xDescrParams.max_len = 50; /* or BLE_GATTS_FIX_ATTR_LEN_MAX or any smaller value * / */
    }
    else
    {
        xErrCode = prvAFRUUIDtoNordic( pxUuid, &ble_uuid );
    }

    if( xErrCode == NRF_SUCCESS )
    {
        xDescrParams.uuid_type = ble_uuid.type;
        xDescrParams.uuid = ble_uuid.uuid;

        xDescrParams.is_var_len = true;
        xDescrParams.max_len = BLE_GATTS_VAR_ATTR_LEN_MAX; /* or BLE_GATTS_FIX_ATTR_LEN_MAX or any smaller value * / */
        xDescrParams.init_len = sizeof( uint8_t );
        xDescrParams.is_value_user = false;

        xDescrParams.is_defered_read = true; /* NOTE: This field is set due to client waits for a callback when desc is read */
        xDescrParams.is_defered_write = false;

        prvAFRToNordicReadPerms( &xPermissions, &xDescrParams.read_access );
        prvAFRToNordicWritePerms( &xPermissions, &xDescrParams.write_access );


/*        if (ble_uuid.type == BLE_UUID_TYPE_BLE && ble_uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG) */
/*        { */
/*            / * This is a CCCD, it should be open to read * / */
/*            xDescrParams.read_access = SEC_OPEN; */
/*        } */

        if( xGattTableSize == GATT_MAX_ENTITIES - 1 )
        {
            xErrCode = NRF_ERROR_NO_MEM;
        }
        else
        {
            xGattTable[ xGattTableSize ].type = GATT_DESCR;
            /* We sets the parent of the descriptor to be the latest added characteristic which belongs to the given service */
            xGattTable[ xGattTableSize ].parent_handle = UINT16_MAX;
            uint16_t usParentNumber = UINT16_MAX;

            for( int16_t i = ( int16_t ) xGattTableSize - 1; i >= 0; --i )
            {
                if( ( xGattTable[ i ].type == GATT_CHAR ) && ( xGattTable[ i ].parent_handle == usServiceHandle ) )
                {
                    usParentNumber = i;
                    xGattTable[ xGattTableSize ].parent_handle = xGattTable[ i ].handle;
                    break;
                }
            }

            /* Set the correct permissions for the responding characteristics CCCD
             * It cannot be SEC_NO_ACCESS as CCCD should always be readable and writable
             */
            if( ( ble_uuid.type == BLE_UUID_TYPE_BLE ) &&
                ( ble_uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG ) &&
                ( usParentNumber != UINT16_MAX ) )
            {
                if( xDescrParams.write_access == SEC_NO_ACCESS )
                {
                    xGattTable[ usParentNumber ].properties.char_properties.cccd_write_access = MAX( SEC_OPEN, xDescrParams.read_access );
                }
                else
                {
                    xGattTable[ usParentNumber ].properties.char_properties.cccd_write_access = xDescrParams.write_access;
                }
            }

            if( xGattTable[ xGattTableSize ].parent_handle == UINT16_MAX )
            {
                xErrCode = NRF_ERROR_INVALID_PARAM;
            }
            else
            {
                xGattTable[ xGattTableSize ].uuid = ble_uuid;
                xGattTable[ xGattTableSize ].handle = xGattTableSize == 0 ? 1 : xGattTable[ xGattTableSize - 1 ].handle + 1;
                xGattTable[ xGattTableSize ].properties.descr_properties = xDescrParams;
                xGattTableSize += 1;
            }
        }
    }

    BT_NRF_PRINT_ERROR( xGattTableDescr, xErrCode );

    xStatus = BTNRFError( xErrCode );

    if( xStatus == eBTStatusSuccess )
    {
       NRF_LOG_INFO( "Descr Added to HAL table with handle %d %x \n\r", xGattTable[ xGattTableSize - 1 ].handle );

        if( xGattServerCb.pxDescriptorAddedCb )
        {
            xGattServerCb.pxDescriptorAddedCb( xStatus,
                                               ulGattServerIFhandle,
                                               pxUuid,
                                               usServiceHandle,
                                               xGattTable[ xGattTableSize - 1 ].handle );
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

ret_code_t prvStartServiceAddDescriptors( uint16_t usCurrentCharNumber,
                                          uint16_t usCCCDhandle )
{
    ret_code_t xErrCode = NRF_SUCCESS;

    for( int i = 0; i < xGattTableSize; ++i )
    {
        if( ( xGattTable[ i ].type == GATT_DESCR ) && ( xGattTable[ i ].parent_handle == xGattTable[ usCurrentCharNumber ].handle ) ) /* Add descriptors */
        {
            /* Check if it is a CCCD handler as for indications and notifications it is registered automatically and we don't need to add it */
            if( ( usCCCDhandle != BLE_GATT_HANDLE_INVALID ) &&
                ( xGattTable[ i ].uuid.type == BLE_UUID_TYPE_BLE ) &&
                ( xGattTable[ i ].uuid.uuid == BLE_UUID_DESCRIPTOR_CLIENT_CHAR_CONFIG ) )
            {
                xGattToSDMapping[ xGattMappingTablesSize ].handle = xGattTable[ i ].handle;
                xGattToSDMapping[ xGattMappingTablesSize ].softdevice_handle = usCCCDhandle;
            }
            else
            {
                /* Non-sequential addition doesn't work in current versions of NRF5 SDK,
                 * if it is added, replace BLE_GATT_HANDLE_INVALID with (prvGattToSDHandle( xGattTable[ i ].parent_handle) */
                xErrCode = descriptor_add( BLE_GATT_HANDLE_INVALID,
                                           &xGattTable[ i ].properties.descr_properties,
                                           &xGattToSDMapping[ xGattMappingTablesSize ].softdevice_handle );
                xGattToSDMapping[ xGattMappingTablesSize ].handle = xGattTable[ i ].handle;
            }

            xGattMappingTablesSize += 1;

            if( xErrCode != NRF_SUCCESS )
            {
                break;
            }

            NRF_LOG_INFO( "Descriptor Added to SD table with handle %d %x \n\r",
                               xGattToSDMapping[ xGattMappingTablesSize - 1 ].softdevice_handle );
        }
    }

