aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gatt_server.c
    BT_NRF_PRINT_ERROR( prvStartServiceAddDescriptors, xErrCode );

    return xErrCode;
}

ret_code_t prvStartServiceAddCharacteristics( uint16_t usCurrentServiceNumber )
{
    ret_code_t xErrCode = NRF_SUCCESS;
    uint16_t usServiceHandle = xGattTable[ usCurrentServiceNumber ].handle;

    for( int i = 0; i < xGattTableSize; ++i )
    {
        if( ( xGattTable[ i ].type == GATT_CHAR ) && ( xGattTable[ i ].parent_handle == usServiceHandle ) )
        {
            ble_gatts_char_handles_t sd_handle;
            uint16_t usSoftDeviceServiceHandle = prvGattToSDHandle( usServiceHandle );

            if( usSoftDeviceServiceHandle == UINT16_MAX )
            {
                xErrCode = NRF_ERROR_INVALID_PARAM;
            }
            else
            {
                xErrCode = characteristic_add( usSoftDeviceServiceHandle,
                                               &xGattTable[ i ].properties.char_properties,
                                               &sd_handle );
                xGattToSDMapping[ xGattMappingTablesSize ].handle = xGattTable[ i ].handle;
                xGattToSDMapping[ xGattMappingTablesSize ].softdevice_handle = sd_handle.value_handle;
                xGattMappingTablesSize += 1;
            }

            if( xErrCode != NRF_SUCCESS )
            {
                break;
            }

            NRF_LOG_INFO( "Charachtersitic Added to SD table with handle %d %x \n\r",
                               xGattToSDMapping[ xGattMappingTablesSize - 1 ].softdevice_handle );

            xErrCode = prvStartServiceAddDescriptors( i, sd_handle.cccd_handle );

            if( xErrCode != NRF_SUCCESS )
            {
                break;
            }
        }
    }

    BT_NRF_PRINT_ERROR( prvStartServiceAddCharacteristics, xErrCode );

    return xErrCode;
}

BTStatus_t prvBTStartService( uint8_t ucServerIf,
                              uint16_t usServiceHandle,
                              BTTransport_t xTransport )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;
    uint16_t usCurrentServiceNumber = UINT16_MAX;

    for( uint16_t i = 0; i < xGattTableSize; ++i )
    {
        if( ( xGattTable[ i ].type == GATT_SERVICE ) && ( xGattTable[ i ].handle == usServiceHandle ) )
        {
            usCurrentServiceNumber = i;
            break;
        }
    }

    if( usCurrentServiceNumber == UINT16_MAX )
    {
        xErrCode = NRF_ERROR_INVALID_PARAM;
    }

    if( xErrCode == NRF_SUCCESS )
    {
        xErrCode = sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY,
                                             &xGattTable[ usCurrentServiceNumber ].uuid,
                                             &xGattToSDMapping[ xGattMappingTablesSize ].softdevice_handle );
        xGattToSDMapping[ xGattMappingTablesSize ].handle = usServiceHandle;
        xGattMappingTablesSize += 1;
    }

    BT_NRF_PRINT_ERROR( prvBTStartService, xErrCode );

    if( xErrCode == NRF_SUCCESS )
    {
        NRF_LOG_INFO( "Service Added to SD table with handle %d %x \n\r ",
                           xGattToSDMapping[ xGattMappingTablesSize - 1 ].softdevice_handle );

        xErrCode = prvStartServiceAddCharacteristics( usCurrentServiceNumber );
    }

    xStatus = BTNRFError( xErrCode );
    xGattServerCb.pxServiceStartedCb( xStatus, ucServerIf, usServiceHandle );

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTStopService( uint8_t ucServerIf,
                             uint16_t usServiceHandle )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    /* It is not supported to stop a GATT service, so we just return success.
     */
    if( xGattServerCb.pxServiceStoppedCb )
    {
        xGattServerCb.pxServiceStoppedCb( eBTStatusSuccess, ucServerIf, usServiceHandle );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDeleteService( uint8_t ucServerIf,
                               uint16_t usServiceHandle )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    /* It is not supported to delete service without reenabling the SoftDevice, so we just return success.
     * https://devzone.nordicsemi.com/f/nordic-q-a/16899/removing-gatt-services
     * TODO: Wait till this functionality is added
     */
    if( xGattServerCb.pxServiceDeletedCb )
    {
        xGattServerCb.pxServiceDeletedCb( eBTStatusSuccess, ucServerIf, usServiceHandle );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSendIndication( uint8_t ucServerIf,
                                uint16_t usAttributeHandle,
                                uint16_t usConnId,
                                size_t xLen,
                                uint8_t * pucValue,
                                bool bConfirm )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    uint32_t err;
    uint16_t len;

    ble_gatts_hvx_params_t hvx_params;

    memset( &hvx_params, 0, sizeof( hvx_params ) );
    hvx_params.handle = prvGattToSDHandle( usAttributeHandle );
    hvx_params.p_data = pucValue;
    len = xLen;
    hvx_params.p_len = &len;

    if( bConfirm )
    {
        hvx_params.type = BLE_GATT_HVX_INDICATION;
    }
    else
    {
        hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
    }

    err = sd_ble_gatts_hvx( usConnId, &hvx_params );

    if( err != 0 )
    {
        NRF_LOG_ERROR( 0, "Error %d HVX \n\r", err );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSendResponse( uint16_t usConnId,
                              uint32_t ulTransId,
                              BTStatus_t xStatus,
                              BTGattResponse_t * pxResponse )
{
    BTStatus_t xReturnStatus = eBTStatusSuccess;
    ret_code_t xErrCode = NRF_SUCCESS;
    ble_gatts_rw_authorize_reply_params_t authreply;

    ble_gatts_value_t writereply;

    switch( ulTransId )
    {
        case BLE_GATTS_AUTHORIZE_TYPE_READ:
            authreply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;

