aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_gatt_server.c
            authreply.params.read.len = pxResponse->xAttrValue.xLen;
            authreply.params.read.offset = pxResponse->xAttrValue.usOffset;
            authreply.params.read.p_data = pxResponse->xAttrValue.pucValue;

            authreply.params.read.update = 1; /* NOTE: This flag is considered only on write event */
            if (xStatus == eBTStatusSuccess){
                authreply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
            } 
            else
            { 
                authreply.params.read.gatt_status = BLE_GATT_STATUS_ATTERR_READ_NOT_PERMITTED;
            }

            xErrCode = sd_ble_gatts_rw_authorize_reply( usConnId, &authreply );

            if( xErrCode != 0 )
            {
                NRF_LOG_ERROR( "Error %d prvBTSendResponse - BLE_GATTS_AUTHORIZE_TYPE_READ \n\r", xErrCode );
            }

            break;

        case BLE_GATTS_AUTHORIZE_TYPE_WRITE:
            authreply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;

            authreply.params.write.len = pxResponse->xAttrValue.xLen;
            authreply.params.write.offset = pxResponse->xAttrValue.usOffset;
            authreply.params.write.p_data = pxResponse->xAttrValue.pucValue;

            authreply.params.write.update = 1;
            if (xStatus == eBTStatusSuccess){
                authreply.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS;
            } 
            else
            { 
                authreply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_WRITE_NOT_PERMITTED;
            }

            xErrCode = sd_ble_gatts_rw_authorize_reply( usConnId, &authreply );

            if( xErrCode != NRF_SUCCESS )
            {
                NRF_LOG_ERROR( "Error %d prvBTSendResponse - BLE_GATTS_AUTHORIZE_TYPE_WRITE \n\r", xErrCode );
            }

            break;

        case 0:
            xStatus = eBTStatusSuccess;

            break;

        default:
            ;
    }

    xReturnStatus = BTNRFError( xErrCode );

    if( xGattServerCb.pxResponseConfirmationCb != NULL )
    {
        xGattServerCb.pxResponseConfirmationCb( xStatus, pxResponse->usHandle );
    }

    return xReturnStatus;
}

/*-----------------------------------------------------------*/

const void * prvBTGetGattServerInterface()
{
    return &xGATTserverInterface;
}

/*-----------------------------------------------------------*/

static void prvAFRToNordicCharProp( const BTCharProperties_t * pxAFRCharProps,
                                    ble_gatt_char_props_t * pxSoftDevCharProps )
{
    if( *pxAFRCharProps & eBTPropBroadcast )
    {
        pxSoftDevCharProps->broadcast = 1;
    }

    if( *pxAFRCharProps & eBTPropRead )
    {
        pxSoftDevCharProps->read = 1;
    }

    if( *pxAFRCharProps & eBTPropWriteNoResponse )
    {
        pxSoftDevCharProps->write_wo_resp = 1;
    }

    if( *pxAFRCharProps & eBTPropWrite )
    {
        pxSoftDevCharProps->write = 1;
    }

    if( *pxAFRCharProps & eBTPropNotify )
    {
        pxSoftDevCharProps->notify = 1;
    }

    if( *pxAFRCharProps & eBTPropIndicate )
    {
        pxSoftDevCharProps->indicate = 1;
    }

    if( *pxAFRCharProps & eBTPropSignedWrite )
    {
        pxSoftDevCharProps->auth_signed_wr = 1;
    }
}

/*-----------------------------------------------------------*/

static void prvAFRToNordicReadPerms( const BTCharPermissions_t * pxAFRPermitions,
                                     security_req_t * pxNordicPermitions )
{
    switch( *pxAFRPermitions & 0x0007 )
    {
        case eBTPermNone:
            *pxNordicPermitions = SEC_NO_ACCESS;
            break;

        case eBTPermRead:
            *pxNordicPermitions = SEC_OPEN;
            break;

        case eBTPermReadEncrypted:
            *pxNordicPermitions = SEC_JUST_WORKS;
            break;

        case eBTPermReadEncryptedMitm:
            *pxNordicPermitions = SEC_MITM;
            break;

        default:
            *pxNordicPermitions = SEC_NO_ACCESS;
    }
}

/*-----------------------------------------------------------*/

static void prvAFRToNordicWritePerms( const BTCharPermissions_t * pxAFRPermitions,
                                      security_req_t * pxNordicPermitions )
{
    switch( *pxAFRPermitions & 0x01F0 )
    {
        case eBTPermNone:
            *pxNordicPermitions = SEC_NO_ACCESS;
            break;

        case eBTPermWrite:
            *pxNordicPermitions = SEC_OPEN;
            break;

        case eBTPermWriteEncrypted:
            *pxNordicPermitions = SEC_JUST_WORKS;
            break;

        case eBTPermWriteEncryptedMitm:
            *pxNordicPermitions = SEC_MITM;
            break;

        case eBTPermWriteSigned:
            *pxNordicPermitions = SEC_SIGNED;
            break;

        case eBTPermWriteSignedMitm:
            *pxNordicPermitions = SEC_SIGNED_MITM;
            break;

        default:
            *pxNordicPermitions = SEC_NO_ACCESS;
    }
}
